Revit 2027 API
DirectShapeLibrary Properties
The DirectShapeLibrary type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
DirectShapeLibrary Class
Autodesk.Revit.DB Namespace